<?php

namespace App\Http\Controllers\Api;

use App\Http\Controllers\Controller;
use App\Settings\GeneralSettings;
use Illuminate\Http\Request;

class AboutSuknaController extends Controller
{
    public function about(GeneralSettings $settings){
        try {
            return $settings->about ?? 'About section not available';
        } catch (\Exception $e) {
            return 'An error occurred: ' . $e->getMessage();
        }
    }

    public function term_and_condition(GeneralSettings $settings){
        try {
            return $settings->term_and_condition ?? 'Terms and conditions not available';
        } catch (\Exception $e) {
            return 'An error occurred: ' . $e->getMessage();
        }
    }

    public function privacy_policy(GeneralSettings $settings){
        try {
            return $settings->privacy_policy ?? 'Privacy policy not available';
        } catch (\Exception $e) {
            return 'An error occurred: ' . $e->getMessage();
        }
    }

    public function project_ownership(GeneralSettings $settings){
        try {
            return 'شروط الاستخدام
مقدمة: 
تهدف هذه السياسة إلى تحديد الشروط والأحكام التي تحكم استخدامك لتطبيقنا لشراء العقارات (سكنة)، وتسهيل عملية شراء العقارات بشكل إلكتروني، يرجى منك قراءة هذه الشروط بعناية قبل استخدام التطبيق. 
المادة الأولى: القبول والالتزام
باستخدامك للتطبيق، فإنك تقر بقراءة هذه الشروط والأحكام، والموافقة عليها دون تحفظ. 
المادة الثانية: التعريفات
التطبيق: يعني تطبيق (سكنة) المتوفر على الأجهزة المحمولة.
 المستخدم: يعني أي شخص يقوم بتسجيل حساب واستخدام التطبيق.
 العقار: يعني أي عقار سكني أو تجاري معروض للبيع عبر التطبيق. 
المالك: يعني مالك العقار المعروض للبيع.
 الشركة: يعني الشركة المالكة والمطورة للتطبيق.
 الخدمات: 
-	يوفر التطبيق منصة إلكترونية تتيح للمستخدمين تصفح العقارات المعروضة، والاطلاع على تفاصيلها، والتواصل مع المالكين، وإتمام عملية الشراء.
-	 لا تضمن الشركة دقة المعلومات المقدمة من قبل المالكين قبل إتمام الصفقة، وتتحمل الشركة مسؤولية فحص هذه المعلومات قبل اتخاذ أي قرار شراء.
 تسجيل الحساب: 
-	يتعين على المستخدم تسجيل حساب ليتمكن من استخدام جميع خدمات التطبيق.
-	يحمل المستخدم مسؤولية الحفاظ على سرية بيانات حسابه. 
-	قد يتم جمع بعض البيانات لأغراض إحصائية أو تحسين الخدمة، دون كشف هوية المستخدم.
عرض العقارات:
-	تقوم الشركة بفحص الإعلانات العقارية قبل نشرها على التطبيق، وفقاً للأنظمة واللوائح ذات الصلة، ولكنها لا تتحمل مسؤولية عن أي معلومات مضللة أو غير دقيقة مقدمة من قبل المالك. 
 عملية الشراء:
-	 يتم الاتفاق على تفاصيل عملية الشراء بعد دفع رسوم الخدمة من قبل المستخدم. 
-	لا تتدخل الشركة في عملية التفاوض على السعر أو الشروط الأخرى. 
-	توصي الشركة باستشارة محامٍ متخصص قبل إتمام أي صفقة عقارية.
 الرسوم والمدفوعات:
-	قد تتضمن بعض الخدمات المقدمة عبر التطبيق رسوماً إضافية، سيتم إعلام العميل أو المستخدم بها. 
-	يتم تحديد طريقة الدفع من قبل الشركة.
 
الخصوصية:
 تحترم الشركة خصوصية المستخدمين وتلتزم بحماية بياناتهم الشخصية وفقاً لسياسة الخصوصية الخاصة بها.
 إخلاء المسؤولية: 
لا تتحمل الشركة أي مسؤولية عن أي خسائر أو أضرار مباشرة أو غير مباشرة ناتجة عن استخدام التطبيق. 
التعديلات: 
تحتفظ منصة "سكنة" بحق تعديل هذه الشروط في أي وقت دون إشعار مسبق. وتُعد النسخة المنشورة على الموقع الرسمي هي النسخة المعتمدة ونافذة المفعول، كما يُعد استمرار استخدام التطبيق بعد التعديل موافقة ضمنية على الشروط الجديدة. 
نطاق التطبيق: 
تشمل هذه السياسة جميع خدمات تطبيق سكنة، بما في ذلك موقع الويب والتطبيق الجوال. وهي جزء ولا يتجزأ من سياسة الخصوصية وسياسة حقوق الملكية الفكرية
القانون الحاكم: 
تُفسر هذه الشروط وفقًا للأنظمة المعمول بها في المملكة العربية السعودية. وفي حال حدوث أي نزاعات ناشئة عن تطبيق هذه الشروط والأحكام فإن الجهات القضائية بمدينة الرياض، هي المختصة بنظر هذا النزاع.

';
        } catch (\Exception $e) {
            return 'An error occurred: ' . $e->getMessage();
        }
    }

    /**
     * Get the unit value for unit reservation.
     *
     * @return \Illuminate\Http\JsonResponse
     */
    public function getUnitValueForUnitReservation(GeneralSettings $settings)
    {
        return response()->json([
            'unit_value_for_unit_reservation' => $settings->serious_value_for_unit_reservation,
        ], 200);
    }

}
